app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "url", "created_at", "updated_at", "author", "date_posted") VALUES ('sdkjcsd', 'sdjdcfac', '2025-06-16 17:45:56.864854', '2025-06-16 17:45:56.864854', 'nayleifwa', NULL) RETURNING "id"
---
  def create
    @article = Article.new(article_params)
    @article.date_posted ||= Time.current

    respond_to do |format|
      if @article.save

DELETE FROM "articles" WHERE "articles"."id" = 5
---
  def destroy
    @article.destroy!

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 5 LIMIT 1
---
    def set_article
      @article = Article.find(params.expect(:id))